app/views/events/show.html.erb

SELECT "missing_people".* FROM "missing_people" WHERE "missing_people"."event_id" = 1
---
  <%= link_to "Add a missing person", new_event_missing_person_path(@event) %>
  <% @event.missing_people.each do |missing_person| %>

SELECT "help_centers".* FROM "help_centers" WHERE "help_centers"."event_id" = 1
---
  <%= link_to "Add a help center", new_event_help_center_path(@event) %>
  <% @event.help_centers.each do |help_center| %>