app/controllers/help_centers_controller.rb

  def create
    @help_center = @event.help_centers.new(params[:help_center])

    respond_to do |format|
      if @help_center.save
---
INSERT INTO "help_centers" ("created_at", "description", "event_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @help_center = @event.help_centers.find(params[:id])
---
SELECT "help_centers".* FROM "help_centers" WHERE "help_centers"."event_id" = 1 AND "help_centers"."id" = ? LIMIT 1  [["id", "5"]]