app/controllers/missing_people_controller.rb

  def create
    @missing_person = @event.missing_people.new(params[:missing_person])

    respond_to do |format|
      if @missing_person.save
---
INSERT INTO "missing_people" ("created_at", "event_id", "information", "name", "updated_at") VALUES (?, ?, ?, ?, ?)

  def set_event
    @event = Event.find params[:event_id]
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]